---
kind: property
id: P:Autodesk.Revit.DB.ExtrusionAnalyzer.ExtrusionDirection
source: html/556d164b-2d06-1bcf-d95a-6fa068db5745.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzer.ExtrusionDirection Property

The direction of extrusion specified for the extrusion analysis.

## Syntax (C#)
```csharp
public XYZ ExtrusionDirection { get; }
```